{
    "Europa": {
            "name": "Europa",
            "startText": "Historia Europy: Od Antyku do Współczesności",
            "startImg": [
                {"id": "chorwacja", "src": "/EuropaData/StartImg/chorwacja.jpg"},
                {"id": "hiszpania", "src": "/EuropaData/StartImg/hiszpania.png"},
                {"id": "islandia", "src": "/EuropaData/StartImg/islandia.png"}
            ],
            "startNames": [
                {"id": "albania", "nazwa": "Albania"},
                {"id": "andora", "nazwa": "Andora"},
                {"id": "austria", "nazwa": "Austria"},
                {"id": "belgia", "nazwa": "Belgia"},
                {"id": "bialorus", "nazwa": "Białoruś"},
                {"id": "bosnia-i-hercegowina", "nazwa": "Bośnia i Hercegowina"},
                {"id": "bulgaria", "nazwa": "Bułgaria"},
                {"id": "chorwacja", "nazwa": "Chorwacja"},
                {"id": "cypr", "nazwa": "Cypr"},
                {"id": "czarnogora", "nazwa": "Czarnogóra"},
                {"id": "czechy", "nazwa": "Czechy"},
                {"id": "dania", "nazwa": "Dania"},
                {"id": "estonia", "nazwa": "Estonia"},
                {"id": "finlandia", "nazwa": "Finlandia"},
                {"id": "francja", "nazwa": "Francja"},
                {"id": "grecja", "nazwa": "Grecja"},
                {"id": "hiszpania", "nazwa": "Hiszpania"},
                {"id": "holandia", "nazwa": "Holandia"},
                {"id": "irlandia", "nazwa": "Irlandia"},
                {"id": "islandia", "nazwa": "Islandia"},
                {"id": "liechtenstein", "nazwa": "Liechtenstein"},
                {"id": "litwa", "nazwa": "Litwa"},
                {"id": "luksemburg", "nazwa": "Luksemburg"},
                {"id": "lotwa", "nazwa": "Łotwa"},
                {"id": "macedonia-polnocna", "nazwa": "Macedonia Północna"},
                {"id": "malta", "nazwa": "Malta"},
                {"id": "mołdawia", "nazwa": "Mołdawia"},
                {"id": "monako", "nazwa": "Monako"},
                {"id": "niemcy", "nazwa": "Niemcy"},
                {"id": "norwegia", "nazwa": "Norwegia"},
                {"id": "polska", "nazwa": "Polska"},
                {"id": "portugalia", "nazwa": "Portugalia"},
                {"id": "rosja", "nazwa": "Rosja"},
                {"id": "rumunia", "nazwa": "Rumunia"},
                {"id": "san-marino", "nazwa": "San Marino"},
                {"id": "serbia", "nazwa": "Serbia"},
                {"id": "slowacja", "nazwa": "Słowacja"},
                {"id": "slowenia", "nazwa": "Słowenia"},
                {"id": "szwajcaria", "nazwa": "Szwajcaria"},
                {"id": "szwecja", "nazwa": "Szwecja"},
                {"id": "turcja", "nazwa": "Turcja"},
                {"id": "ukraina", "nazwa": "Ukraina"},
                {"id": "wegry", "nazwa": "Węgry"},
                {"id": "wielka-brytania", "nazwa": "Wielka Brytania"},
                {"id": "wlochy", "nazwa": "Włochy"},
                {"id": "watykan", "nazwa": "Watykan"},
                {"id": "kosowo", "nazwa": "Kosowo"}
            ],
            "Starożytność" : {
                "title": "Starożytność",
                "text1": "Potęga Rzymu: Rzymianie przejęli grecką kulturę i połączyli ją z militarną potęgą oraz geniuszem inżynieryjnym. Stworzyli Imperium Rzymskie, które zjednoczyło większość kontynentu pod jednym prawem. Rzymskie drogi, akwedukty i – przede wszystkim – kodeksy prawne stały się szkieletem przyszłej Europy. U schyłku tej epoki kluczową rolę zaczęło odgrywać chrześcijaństwo, stając się spoiwem nowej rzeczywistości.",
                "text2": "Dziedzictwo Grecji: To starożytni Grecy dali Europie to, co najcenniejsze: demokrację, filozofię, teatr i kanony piękna w architekturze. Ateny stały się pierwszym laboratorium wolnej myśli, gdzie pytania o naturę świata i człowieka zadawali Sokrates czy Platon",
                "img": [
                    {"id": "ATENY", "src": "/EuropaData/StarozytnoscImg/ateny.jpg", "opis": "Polityczna mapa regionu Morza Śródziemnego. "},
                    {"id": "GRECJA1", "src": "/EuropaData/StarozytnoscImg/grecja1.jpg", "opis": "Akropol ateński, ufortyfikowane wzgórze dominujące nad Atenami. "},
                    {"id": "PROMATHOS", "src": "/EuropaData/StarozytnoscImg/AtenaPromathos.jpg", "opis": "Atena Promachos"},
                    {"id": "GRECJA3", "src": "/EuropaData/StarozytnoscImg/grecja4.jpeg", "opis": "Stanowisko archeologiczne w Delfach w Grecji, wpisane na Listę Światowego Dziedzictwa UNESCO. "},
                    {"id": "GRECJA4", "src": "/EuropaData/StarozytnoscImg/grecja5.jpg", "opis": "Odeon Heroda Attyka, starożytny kamienny teatr położony na południowo-zachodnim zboczu Akropolu ateńskiego w Atenach"},
                    {"id": "SOKRATES", "src": "/EuropaData/StarozytnoscImg/sokrates.jpg", "opis": "Posąg Sokratesa, wybitnego greckiego filozofa z V wieku p.n.e."},
                    {"id": "RZYM1", "src": "/EuropaData/StarozytnoscImg/rzym1.jpg", "opis": "Diogenes wyrzucający miskę - moment z życia słynnego greckiego filozofa cynickiego Diogenesa z Synopy"},
                    {"id": "RZYM2", "src": "/EuropaData/StarozytnoscImg/rzym2.jpg", "opis": "Forum Romanum, najstarszy plac miejski i główne centrum polityczne, religijne i towarzyskie starożytnego Rzymu."},
                    {"id": "RZYM3", "src": "/EuropaData/StarozytnoscImg/rzym4.jpg", "opis": "Plac Świętego Piotra."}
                ]
            },
            "Nowożytność": {
                "title": "Nowożytność",
                "text1": "Epoka ta przyniosła gwałtowne przebudzenie i zmianę perspektywy z teocentrycznej na antropocentryczną – człowiek stanął w centrum wszechświata.",
                "text2": "Humanizm i powrót do wzorców antycznych zaowocowały eksplozją sztuki (Da Vinci, Michał Anioł) oraz przełomami naukowymi, takimi jak teoria heliocentryczna Kopernika, która zburzyła dotychczasowy obraz kosmosu. Równocześnie, dzięki odwadze żeglarzy takich jak Kolumb czy Magellan, Europa przełamała granice horyzontu, rozpoczynając erę Wielkich Odkryć Geograficznych.Druk również dzięki swojemu rozwojowi wspomógł szybsze przekazywanie informacji. Stary Kontynent stał się centrum globalnego handlu i hegemonem, budującym kolonialne imperia od obu Ameryk po Indie, co przyniosło Europie niewyobrażalne bogactwo, ale też zapoczątkowało krwawą rywalizację mocarstw i reformację religijną, która trwale podzieliła chrześcijaństwo.",
                "img": [
                    {"id": "CZLOWIEK", "src": "/EuropaData/NowozytnoscImg/czlowiek.jpg", "opis": "Człowiek witruwiański - słynne dzieło Leonarda da Vinci."},
                    {"id": "KOPERNIK", "src": "/EuropaData/NowozytnoscImg/kopernik.jpg", "opis": "Mikołaj Kopernik twórca teorii heliocentrycznej."},
                    {"id": "LUTER", "src": "/EuropaData/NowozytnoscImg/luter.jpg", "opis": "Marcin Luter, niemiecki teolog, duchowny i inicjator reformacji."},
                    {"id": "MAGELLAN", "src": "/EuropaData/NowozytnoscImg/magellan.jpg", "opis": "Odkrywca Portugalii, a później Hiszpanii, który odkrył Cieśninę Magellana, przewodząc pierwszej wyprawie, która z powodzeniem opłynęła kulę ziemską"},
                    {"id": "MICHALANIOL", "src": "/EuropaData/NowozytnoscImg/michalaniol.jpeg", "opis": "Fresk Michała Anioła zatytułowany: Stworzenie Adama. Jedno z najbardziej rozpoznawalnych dzieł sztuki na świecie, znajdujące się na sklepieniu Kaplicy Sykstyńskiej w Watykanie. "},
                    {"id": "ODKRYCIEAMERYKI", "src": "/EuropaData/NowozytnoscImg/odkrycieameryki.jpg", "opis": "Pierwsze chwile Krzysztofa Kolumba w ameryce."},
                    {"id": "ROZWOJDRUKU", "src": "/EuropaData/NowozytnoscImg/rozwojdruku.jpg", "opis": "Pracownik obsługujący wczesną prasę drukarską, wynalezioną przez Jana Gutenberga. "},
                    {"id": "STARAMAPA", "src": "/EuropaData/NowozytnoscImg/staramapa.jpg", "opis": "Mapa arabskiego kartografa al-Idrisiego z 1154, Tabula Idrisiana, była jedną z najdokładniejszych map świata sprzed epoki europejskich wypraw."},
                    {"id": "UPADEKRZYMU", "src": "/EuropaData/NowozytnoscImg/upadek_rzymu.jpg", "opis": "Obraz nosi tytuł: Genzeryk zdobywa Rzym w 455 roku, , namalowany przez Karla Briułłowa. Przedstawia on splądrowanie Rzymu przez Wandalów pod wodzą Genzeryka. "}
                ]
            },
            "Średniowiecze": {
                "title": "Średniowiecze",
                "text1": "Ta trwająca tysiąc lat epoka, niesłusznie zwana „wiekami ciemnymi”, była czasem rodzenia się europejskich narodów i uniwersalnej kultury łacińskiej. Po upadku Rzymu i chaosie Wędrówek Ludów, Kościół Katolicki stał się jedyną instytucją spajającą rozbity kontynent, przechowując wiedzę w klasztornych skryptoriach i tworząc sieć pierwszych uniwersytetów (Bolonia, Paryż, Kraków).",
                "text2": "Był to czas feudalizmu, gdzie społeczeństwo dzieliło się na tych, co się modlą, walczą i pracują, oraz czas narodzin etosu rycerskiego i wielkich królestw – Francji, Anglii, czy monarchii Karola Wielkiego. Mimo epidemii Czarnej Śmierci i wojen, to właśnie wtedy rozkwitły miasta, powstały systemy cechowe i parlamentaryzm, a gotyckie katedry pnące się ku niebu stały się dowodem na niezwykły kunszt inżynieryjny ówczesnej Europy.",
                "img":[
                    {"id": "BOLONIA", "src": "/EuropaData/SredniowieczeImg/bolonia.jpg", "opis": "Archiginnasio to jeden z najważniejszych pałaców w Bolonii, niegdyś będący siedzibą starożytnego uniwersytetu."},
                    {"id": "DZUMA", "src": "/EuropaData/SredniowieczeImg/dzuma.jpg", "opis": "Lekarze dżumy, którzy działali podczas epidemii dżumy, znanej jako Czarna Śmierć, w średniowiecznej Europie. "},
                    {"id": "HUSARIA", "src": "/EuropaData/SredniowieczeImg/husaria.jpg", "opis": "Szarża polskiej ciężkozbrojnej jazdy - husarii, która była charakterystyczną formacją wojskową Rzeczypospolitej."},
                    {"id": "KOSCIOL", "src": "/EuropaData/SredniowieczeImg/kosciol.jpg", "opis": "Bazylika archikatedralna Świętych Stanisława i Wacława na Wawelu w Krakowie."},
                    {"id": "MIASTA", "src": "/EuropaData/SredniowieczeImg/miasta.jpg", "opis": "Panorama miasta z lotu ptaka w epoce przejściowej między średniowieczem a renesansem."},
                    {"id": "MIESZCZANIE", "src": "/EuropaData/SredniowieczeImg/mieszczanie.jpg", "opis": "Krakowscy mieszczanie w charakterystycznych strojach."},
                    {"id": "OGRODZIENIEC", "src": "/EuropaData/SredniowieczeImg/ogrodzieniec.jpg", "opis": "Rycina przedstawiająca Zamek Ogrodzieniec w Podzamczu na Jurze Krakowsko-Częstochowskiej."},
                    {"id": "WIES", "src": "/EuropaData/SredniowieczeImg/wies.jpg", "opis": "Ożywiona scena chłopskiego wesela i uczty odbywającej się na świeżym powietrzu, przed wiejską chatą - realia średniowiecznych chłopów."},
                    {"id": "ZBROJARYCZERZA", "src": "/EuropaData/SredniowieczeImg/zbroja_rycerza.jpg", "opis": "Pełna, płytowa zbroja, odpowiadająca stylistycznie późnemu średniowieczu."}
                ]

            },
            "Współczesność": {
                "title": "Współczesność",
                "text1": "Epoka współczesna to obecnie trwający okres historii, którego fundamentem były I i II wojna światowa. Konflikty te doprowadziły do upadku dawnych imperiów, ogromnych zniszczeń i śmierci milionów ludzi, a II wojna światowa dodatkowo ujawniła skalę zbrodni totalitarnych systemów. Po 1945 roku Europa została podzielona między dwa przeciwstawne bloki, z których wschodni opierał się na komunizmie i silnej kontroli państwa, a zachodni na demokracji i współpracy.",
                "text2": "Doświadczenia wojen stały się impulsem do poszukiwania trwałego pokoju, czego efektem było powstanie Unii Europejskiej jako wspólnoty mającej zapobiegać kolejnym konfliktom. Współczesność pozostaje więc epoką napięć, pamięci o dramatycznych wydarzeniach XX wieku oraz ciągłego dążenia do stabilności i porozumienia między państwami.",
                "img":[
                    {"id": "CZOLGI", "src": "/EuropaData/WspolczesnoscImg/czolgi.jpg", "opis": "Niemieckie czołgi lekkie Panzer 38(t) podczas inwazji na Polskę we wrześniu 1939 roku."},
                    {"id": "DRUGAWOJNA", "src": "/EuropaData/WspolczesnoscImg/drugawojna.jpg", "opis": "Kluczowe momenty i siły zaangażowane w pierwsze dni II wojny światowej."},
                    {"id": "FLAGA", "src": "/EuropaData/WspolczesnoscImg/flaga.jpeg", "opis": "Podniesienie sztandaru nad Reichstagiem."},
                    {"id": "KOMUNIZM", "src": "/EuropaData/WspolczesnoscImg/komunizm.jpg", "opis": "Charakterystyczną scena z okresu Polskiej Rzeczypospolitej Ludowej, ukazującą kolejkę ludzi oczekujących na zakup towarów deficytowych."},
                    {"id": "MURBERLINSKI", "src": "/EuropaData/WspolczesnoscImg/murberlinski.jpg", "opis": "Grupa bawiących się dzieci na ulicy, tuż przy Murze Berlińskim, który oddziela je od Berlina Wschodniego."},
                    {"id": "PIERWSZAWOJNA", "src": "/EuropaData/WspolczesnoscImg/pierwszawojna.jpg", "opis": "Polscy legionisci na pozycji strzeleckiej w okopie."},
                    {"id": "ZOLNIERZE", "src": "/EuropaData/WspolczesnoscImg/pierwszawojnazolnierze.jpg", "opis": "Brytyjscy (lub alianccy) żołnierze obsługujący ciężki karabin maszynowy Vickers podczas I wojny światowej."},
                    {"id": "EURO", "src": "/EuropaData/WspolczesnoscImg/euro.jpeg", "opis": "Asortyment banknotów i monet euro, oficjalnej waluty Unii Europejskiej."},
                    {"id": "UNIA", "src": "/EuropaData/WspolczesnoscImg/unia.jpg", "opis": "Flaga Unii Europejskiej."}
                ]
            },
            "Wydarzenia": [
                {
                    "title": "Narodziny Chrześcijaństwa",
                    "text": "Chrześcijaństwo narodziło się na terenie Imperium Rzymskiego jako religia prześladowana. Jego nauki opierały się na miłości bliźniego, równości ludzi wobec Boga i nadziei na życie wieczne. Chrześcijaństwo ukształtowało kulturę, moralność i system wartości Europy na kolejne stulecia.",
                    "img": "/EuropaData/WydarzeniaImg/chrzescijanstwo.jpg"
                },
                {
                    "title": "Wynalezienie pisma",
                    "text": "Wynalezienie pisma w Mezopotamii było jednym z najważniejszych momentów w dziejach ludzkości. Dzięki pismu ludzie mogli zapisywać prawa, umowy handlowe, wierzenia religijne oraz ważne wydarzenia. Pozwoliło to na sprawne zarządzanie państwem i przekazywanie wiedzy kolejnym pokoleniom. Od tego momentu możliwe stało się badanie historii na podstawie źródeł pisanych, a nie tylko domysłów archeologicznych.",
                    "img": "/EuropaData/WydarzeniaImg/pismo.png"
                },
                {
                    "title": "Powstanie demokracji ateńskiej",
                    "text": "W Atenach wykształcił się system, w którym wolni obywatele mieli prawo brać udział w zgromadzeniach ludowych i podejmować decyzje dotyczące państwa. Choć demokracja ta nie obejmowała kobiet, niewolników i cudzoziemców, była przełomowa. Po raz pierwszy w historii władza nie należała wyłącznie do króla lub elity. Idee demokracji ateńskiej stały się fundamentem nowoczesnych systemów politycznych.",
                    "img": "/EuropaData/WydarzeniaImg/demokracja.png"
                },
                {
                    "title": "Upadek Cesarstwa Zachodniorzymskiego",
                    "text": "Upadek cesarstwa był wynikiem kryzysu gospodarczego, politycznego i najazdów ludów barbarzyńskich. Zanikła sprawna administracja, handel i bezpieczeństwo. Europa Zachodnia weszła w okres rozdrobnienia politycznego. Wydarzenie to symbolicznie kończy epokę starożytności i rozpoczyna średniowiecze.",
                    "img": "/EuropaData/WydarzeniaImg/upadek_cesarstwa.jpg"
                },
                {
                    "title": "Wyprawy krzyżowe",
                    "text": "Krucjaty były serią wypraw zbrojnych organizowanych przez chrześcijan w celu odzyskania Jerozolimy z rąk muzułmanów. Motywowane były religijnie, ale także politycznie i ekonomicznie. Choć militarnie często kończyły się porażką, doprowadziły do rozwoju handlu, wymiany kulturowej oraz poznania nowych towarów i idei. Jednocześnie przyniosły ogromne cierpienie i zniszczenia.",
                    "img": "/EuropaData/WydarzeniaImg/wyprawy.jpg"
                },
                {
                    "title": "Powstanie uniwersytetów",
                    "text": "Pierwsze uniwersytety powstały jako centra nauki i dyskusji intelektualnej. Kształcono tam duchownych, prawników i lekarzy. Nauczanie opierało się na filozofii i logice, a wiedza była systematyzowana. Uniwersytety stały się fundamentem rozwoju nauki w Europie.",
                    "img": "/EuropaData/WydarzeniaImg/uniwersytet.jpg"
                },
                {
                    "title": "Wielkie odkrycia geograficzne",
                    "text": "Europejczycy rozpoczęli dalekie wyprawy morskie w poszukiwaniu nowych dróg handlowych. Doprowadziło to do odkrycia Ameryki i opłynięcia Ziemi. Odkrycia te zmieniły gospodarkę świata, zapoczątkowały kolonializm i doprowadziły do podporządkowania oraz wyniszczenia wielu ludów tubylczych. Europa stała się centrum światowej polityki i handlu.",
                    "img": "/EuropaData/WydarzeniaImg/wielkie_odkrycia.jpg"
                },
                {
                    "title": "Rewolucja francuska",
                    "text": "Rewolucja francuska była buntem społeczeństwa przeciwko nierównościom i władzy absolutnej króla. Zniesiono przywileje stanowe i ogłoszono prawa człowieka i obywatela. Choć rewolucja doprowadziła do chaosu i terroru, jej idee wpłynęły na rozwój demokracji i nowoczesnych państw na całym świecie.",
                    "img": "/EuropaData/WydarzeniaImg/rewolucja.jpg"
                },
                {
                    "title": "Rewolucja przemysłowa",
                    "text": "Wprowadzenie maszyn i fabryk radykalnie zmieniło produkcję i życie codzienne. Ludzie masowo przenosili się do miast, powstała klasa robotnicza. Warunki pracy były ciężkie, co prowadziło do protestów i narodzin ruchów robotniczych. Rewolucja przemysłowa przyspieszyła rozwój cywilizacji, ale pogłębiła nierówności społeczne.",
                    "img": "/EuropaData/WydarzeniaImg/rewolucja_przemyslowa.jpg"
                },
                {
                    "title": "I wojna światowa",
                    "text": "Wojna objęła większość państw Europy i wykorzystała nowoczesną broń, co doprowadziło do ogromnych strat ludzkich. Załamał się dawny porządek polityczny, a wielkie imperia przestały istnieć. Konflikt pozostawił Europę zniszczoną i pełną napięć, które nie zostały rozwiązane.",
                    "img": "/EuropaData/WydarzeniaImg/pierwsza_wojna.jpg"
                },
                {
                    "title": "Wielki kryzys gospodarczy",
                    "text": "Krach giełdowy w USA spowodował globalny kryzys. Miliony ludzi straciły pracę, oszczędności i poczucie bezpieczeństwa. Państwa nie radziły sobie z problemami społecznymi, co sprzyjało wzrostowi poparcia dla radykalnych ideologii i dyktatur.",
                    "img": "/EuropaData/WydarzeniaImg/wielki_kryzys.jpg"
                },
                {
                    "title": "II wojna światowa",
                    "text": "II wojna światowa objęła niemal cały świat i pochłonęła dziesiątki milionów ofiar. Naziści dokonali planowej zagłady Żydów i innych grup. Wojna zakończyła się klęską Niemiec i Japonii oraz całkowitą zmianą układu sił politycznych. Europa była zrujnowana, a świat podzielony na nowe strefy wpływów.",
                    "img": "/EuropaData/WydarzeniaImg/druga_wojna.jpg"
                },
                {
                    "title": "Zimna wojna",
                    "text": "Upadek muru berlińskiego i rozpad ZSRR zakończyły epokę zimnej wojny. Kraje Europy Środkowo-Wschodniej odzyskały suwerenność i rozpoczęły proces przemian politycznych i gospodarczych. Świat wszedł w nowy etap globalnych powiązań.",
                    "img": "/EuropaData/WydarzeniaImg/zimna_wojna.jpg"
                }
            ]
            
        },


    "Azja": {
            "name": "Azja",
            "startText": "Azja: tradycja i przemiany historii",
            "startImg": [
                {"id": "Wzgórze Adama", "src": "/AzjaData/StartImg/Adams-Peak.jpg"},
                {"id": "Bagan", "src": "AzjaData/StartImg/Bagan.jpg"},
                {"id": "Komodo", "src": "AzjaData/StartImg/Komodo.jpg"}
            ],
            "Starożytność" : {
                "title": "Starożytność",
                "text1": "Starożytna Azja to czas narodzin pierwszych wielkich cywilizacji, w których rozwój rolnictwa, miasta-państwa i systemów administracyjnych stworzył fundamenty życia społecznego, politycznego i gospodarczego. W dolinach rzek Huang He i Jangcy w Chinach, Indusu w Indiach czy Tygrysu i Eufratu w Mezopotamii powstawały pierwsze osady, które dzięki dostępowi do wody mogły produkować nadwyżki żywności i rozwijać handel lokalny. Wynalezienie pisma klinowego w Mezopotamii i chińskiego pisma ideograficznego umożliwiło zapis prawa, handlu, historii i administracji, a spisane kodeksy prawne, jak słynny kodeks Hammurabiego, wprowadzały porządek i regulowały życie codzienne. ",
                "text2": "W tym samym czasie powstawały fundamenty wielkich religii i filozofii – hinduizm i buddyzm w Indiach, konfucjanizm i taoizm w Chinach – które kształtowały etykę, życie rodzinne i relacje między władzą a społeczeństwem. Jednocześnie rozwijał się handel na długich dystansach, zwłaszcza wzdłuż Jedwabnego Szlaku, co pozwalało wymieniać towary, technologie i idee między Azją, Bliskim Wschodem i Europą, tworząc pierwsze globalne sieci wymiany. Starożytność w Azji była więc okresem dynamicznego rozwoju cywilizacyjnego, który położył podwaliny pod kulturę, religię i państwowość na wiele stuleci.",
                "img": [
                    {"id": "PISMOKLINOWE", "src": "/StarozytnoscImg/pismo_klinowe.jpg", "opis": "Tabliczka z pismem klinowym, jednym z najstarszych systemów pisma, używanym w starożytnej Mezopotamii."},
                    {"id": "PISMOIDEOGRAFICZNE", "src": "/StarozytnoscImg/pismo_ideograficzne.jpg", "opis": "Pismo ideograficzne używane w Chinach, które opierało się na symbolach reprezentujących pojęcia."},
                    {"id": "KALI", "src": "/StarozytnoscImg/kali.jpg", "opis": "Kali, bóstwo hinduskie, symbolizującego zniszczenie i odbudowę świata."},
                    {"id": "HISTORIABUDDY", "src": "/StarozytnoscImg/zycie_buddy.jpeg", "opis": "Sceny z życia Buddy, założyciela buddyzmu."},
                    {"id": "KOLODHARMY", "src": "/StarozytnoscImg/kolo_dharmy.png", "opis": "Najpopularniejszy symbol buddyjski"},
                    {"id": "KONFUCJUSZ", "src": "/StarozytnoscImg/konfucjusz.jpg", "opis": "Konfucjusz, filozof chiński, założyciel konfucjanizmu."},
                    {"id": "TAOIZM", "src": "/StarozytnoscImg/taoizm.jpg", "opis": "Symbol będący fundamentem taoizmu – chińskiego systemu filozoficznego i religijnego, który kładzie nacisk na życie w harmonii z naturalnym porządkiem wszechświata (Tao)."},
                    {"id": "LISI", "src": "/StarozytnoscImg/LiSi.jpg", "opis": "Najsłynniejszy praktyk legizmu, kanclerz w państwie Qin."},
                    {"id": "MOTIZM", "src": "/StarozytnoscImg/motizm.jpg", "opis": "Mo Di, chiński filozof, założyciel motyzmu, który głosił uniwersalną miłość i sprzeciwiał się wojnom."}
                ]
            },
            "Nowożytność": {
                "title": "Nowożytność",
                "text1": "Epoka nowożytna w Azji to czas intensywnych kontaktów z Europą, rozwoju potężnych państw i jednoczesnej presji zewnętrznych mocarstw. Dynastie Ming i Qing w Chinach rozwijały administrację, gospodarkę i kulturę, budując monumentalne budowle, takie jak Zakazane Miasto, jednocześnie kontrolując handel i rozwijając rolnictwo. W Indiach Imperium Mogołów jednoczyło subkontynent, wznosząc wspaniałe zabytki architektury i wzmacniając system administracyjny. ",
                "text2": "W tym samym czasie Portugalczycy, Holendrzy i Brytyjczycy pojawili się w Azji, zakładając faktorie handlowe i zwiększając znaczenie handlu kolonialnego – zwłaszcza przyprawami, jedwabiem i herbatą. Imperia osmańskie kontrolowały strategiczne szlaki między Azją a Europą, a lokalne władze musiały balansować między utrzymaniem niezależności a korzystaniem z kontaktów handlowych. To była epoka zarówno rozkwitu państw azjatyckich, jak i powolnej ingerencji europejskiej, która przyniosła nowe technologie, towary i konflikty polityczne, tworząc podstawy globalnej gospodarki.",
                "img": [
                    {"id": "BABUR", "src": "SredniowieczeImg/babur.jpg", "opis": "Babur, założyciel Imperium Mogołów w Indiach."},
                    {"id": "IMPERIUMMOGOLOW", "src": "/NowozytnoscImg/imperium_mogolow.jpg", "opis": "Zmiany terytorialne imperia mogołów w Indiach."},
                    {"id": "HONGWU", "src": "/NowozytnoscImg/hongwu.jpg", "opis": "Huang Ti (Hóngwǔ), założyciel dynastii Ming."},
                    {"id": "DYNASTIAMINGOW", "src": "/NowozytnoscImg/dynastia_mingow.png", "opis": "Mapa terytorium dynastii Ming w Chinach."},
                    {"id": "MANDZUROWIE", "src": "/NowozytnoscImg/mandzurowie.jpg", "opis": "Naród twórca dynastii Qing."},
                    {"id": "DYNASTIAQINGOW", "src": "/NowozytnoscImg/dynastia_qinow.jpg", "opis": "Obszar panowania dynastii Qing."},
                    {"id": "ZAKAZANEMIASTO", "src": "/NowozytnoscImg/zakazane_miasto.jpg", "opis": "Zakazane Miasto, symbol władzy dynastii Ming."},
                    {"id": "TAJMAHAL", "src": "/NowozytnoscImg/taj_mahal.jpg", "opis": "Taj Mahal - przykład architektury Mogołów, łączącej wpływy perskie, islamskie i indyjskie."},
                    {"id": "KANGXI", "src": "/NowozytnoscImg/kangxi.jpg", "opis": "Kang Xi, jeden z najważniejszych cesarzy dynastii Qing."}
                ]
            },
            "Średniowiecze": {
                "title": "Średniowiecze",
                "text1": "Średniowieczna Azja to okres, w którym kontynent stał się areną powstawania wielkich imperiów, rozwoju religii i nauki oraz intensywnej wymiany handlowej i kulturowej. Po upadku starożytnych państw wiele regionów zyskało nowe formy organizacji – w Azji Zachodniej i Środkowej rozpowszechnił się islam, który nie tylko wpływał na duchowość, lecz także na prawo, handel i administrację państwową. W Chinach dynastie Tang i Song wprowadzały innowacje technologiczne, rozwijały literaturę, sztukę i filozofię, a dzięki Jedwabnemu Szlakowi wzrastała wymiana towarów, idei i wynalazków. ",
                "text2": "W XIII w. Mongołowie pod wodzą Czyngis-chana stworzyli największe imperium lądowe w historii, łącząc ogromne terytoria Azji, co ułatwiło handel między Wschodem a Zachodem i przyczyniło się do rozprzestrzenienia technologii i kultury. W tym czasie miasta handlowe rozkwitały, a kontakty między cywilizacjami stawały się coraz intensywniejsze. Średniowiecze w Azji to epoka jednocześnie wojen i ekspansji, ale też wielkich odkryć intelektualnych i kulturalnych, które kształtowały rozwój nauki, architektury i sztuki w całym regionie.",
                "img":[
                    {"id": "CZYNGISCHAN", "src": "SredniowieczeImg/czyngischan.jpg", "opis": "Czyngis Chan, założyciel imperium mongolskiego."},
                    {"id": "IMPERIUMMONGOLOW", "src": "SredniowieczeImg/imperium_mongolskie.jpg", "opis": "Zakres panowania imperium mongolskiego w szczytowym okresie jego rozwoju."},
                    {"id": "MAHOMET", "src": "SredniowieczeImg/mahomet.jpg", "opis": "Mahomet, założyciel islamu."},
                    {"id": "MEKKA", "src": "SredniowieczeImg/mekka.jpg", "opis": "Święty Meczet, święte miejsce dla wyznawców islamu."},
                    {"id": "JEDWABNYSZLAK", "src": "SredniowieczeImg/jedwabny_szlak.jpg", "opis": "Jedwabny Szlak - ważna droga handlowa w Azji Środkowej."},
                    {"id": "BAGDAD", "src": "SredniowieczeImg/bagdad.jpg", "opis": "W średniowieczu  z najważniejszych ośrodków nauki, handlu i kultury świata islamskiego, znanym jako „Miasto Pokoju” (Madinat as-Salam)."},
                    {"id": "KONSTYNANTYNOPOL", "src": "SredniowieczeImg/konstynantopol.JPG", "opis": "Miasto posiadające kontrolę nad handlem między Azją a Europą."},
                    {"id": "WIES", "src": "SredniowieczeImg/wies.jpg"},
                    {"id": "ZBROJARYCZERZA", "src": "SredniowieczeImg/zbroja_rycerza.jpg"}
                ]
            },
            "XIX wiek": {
                "title": "XIX wiek",
                "text1": "W XIX w. Azja została zdominowana przez europejskie mocarstwa kolonialne, które zmieniały strukturę społeczną, polityczną i gospodarczą kontynentu. Brytyjczycy w Indiach wprowadzili administrację kolonialną i zmienili system gospodarczy, przekształcając rolnictwo i handel w służbie imperium. W Chinach wojny opiumowe wymusiły otwarcie portów dla handlu europejskiego, co osłabiło władzę cesarską i doprowadziło do licznych napięć społecznych. ",
                "text2": "Japonia zakończyła okres izolacji politycznej upadkiem siogunatu i rozpoczęła reformy Meiji, modernizując armię, administrację i przemysł, aby stać się równorzędnym uczestnikiem w globalnej polityce. W tym okresie wzrosły napięcia między mocarstwami kolonialnymi a lokalnymi elitami, co często prowadziło do buntów i prób obrony suwerenności. Epoka kolonializmu ukształtowała wiele współczesnych problemów Azji, ale jednocześnie wymusiła modernizację i integrację z globalnym handlem.",
                "img":[
                    {"id": "CZOLGI", "src": "WspolczesnoscImg/czolgi.jpg"},
                    {"id": "DRUGAWOJNA", "src": "WspolczesnoscImg/drugawojna.jpg"},
                    {"id": "EURO", "src": "WspolczesnoscImg/euro.jpeg"},
                    {"id": "FLAGA", "src": "WspolczesnoscImg/flaga.jpeg"},
                    {"id": "KOMUNIZM", "src": "WspolczesnoscImg/komunizm.jpg"},
                    {"id": "MURBERLINSKI", "src": "WspolczesnoscImg/murberlinski.jpg"},
                    {"id": "PIERWSZAWOJNA", "src": "WspolczesnoscImg/pierwszawojna.jpg"},
                    {"id": "ZOLNIERZE", "src": "WspolczesnoscImg/pierwszawojnazolnierze.jpg"},
                    {"id": "UNIA", "src": "WspolczesnoscImg/unia.jpg"}
                ]
            },
            "Współczesność": {
                "title": "Współczesność",
                "text1": "XX wiek w Azji to czas gwałtownych przemian politycznych, społecznych i gospodarczych. Po II wojnie światowej wiele krajów odzyskało niepodległość, a proces dekolonizacji zmienił mapę kontynentu – Indie, Indonezja, Filipiny i wiele innych państw zyskały suwerenność. W Chinach Mao Zedong wprowadził rewolucję komunistyczną, przekształcając strukturę społeczną, gospodarczą i polityczną kraju, podczas gdy Korea Północna i Wietnam wprowadzały własne systemy socjalistyczne. ",
                "text2": "Wojna koreańska i wojna w Wietnamie były przejawem zimnowojennego konfliktu, w którym Azja stała się areną rywalizacji supermocarstw. Jednocześnie Japonia, Korea Południowa i Chiny doświadczyły dynamicznego rozwoju gospodarczego, stając się nowoczesnymi ośrodkami przemysłowymi i technologicznymi. XX wiek pokazał, że Azja jest kontynentem pełnym kontrastów – od konfliktów i rewolucji po imponujący wzrost gospodarczy i odbudowę państw po kolonializmie i wojnach.",
                "img":[
                    {"id": "CZOLGI", "src": "WspolczesnoscImg/czolgi.jpg"},
                    {"id": "DRUGAWOJNA", "src": "WspolczesnoscImg/drugawojna.jpg"},
                    {"id": "EURO", "src": "WspolczesnoscImg/euro.jpeg"},
                    {"id": "FLAGA", "src": "WspolczesnoscImg/flaga.jpeg"},
                    {"id": "KOMUNIZM", "src": "WspolczesnoscImg/komunizm.jpg"},
                    {"id": "MURBERLINSKI", "src": "WspolczesnoscImg/murberlinski.jpg"},
                    {"id": "PIERWSZAWOJNA", "src": "WspolczesnoscImg/pierwszawojna.jpg"},
                    {"id": "ZOLNIERZE", "src": "WspolczesnoscImg/pierwszawojnazolnierze.jpg"},
                    {"id": "UNIA", "src": "WspolczesnoscImg/unia.jpg"}
                ]
            },
            "Wydarzenia": [
                {
                    "title": "Narodziny Chrześcijaństwa",
                    "text": "Chrześcijaństwo narodziło się na terenie Imperium Rzymskiego jako religia prześladowana. Jego nauki opierały się na miłości bliźniego, równości ludzi wobec Boga i nadziei na życie wieczne. Chrześcijaństwo ukształtowało kulturę, moralność i system wartości Europy na kolejne stulecia.",
                    "img": "WydarzeniaImg/chrzescijanstwo.jpg"
                },
                {
                    "title": "Wynalezienie pisma",
                    "text": "Wynalezienie pisma w Mezopotamii było jednym z najważniejszych momentów w dziejach ludzkości. Dzięki pismu ludzie mogli zapisywać prawa, umowy handlowe, wierzenia religijne oraz ważne wydarzenia. Pozwoliło to na sprawne zarządzanie państwem i przekazywanie wiedzy kolejnym pokoleniom. Od tego momentu możliwe stało się badanie historii na podstawie źródeł pisanych, a nie tylko domysłów archeologicznych.",
                    "img": "WydarzeniaImg/pismo.png"
                },
                {
                    "title": "Powstanie demokracji ateńskiej",
                    "text": "W Atenach wykształcił się system, w którym wolni obywatele mieli prawo brać udział w zgromadzeniach ludowych i podejmować decyzje dotyczące państwa. Choć demokracja ta nie obejmowała kobiet, niewolników i cudzoziemców, była przełomowa. Po raz pierwszy w historii władza nie należała wyłącznie do króla lub elity. Idee demokracji ateńskiej stały się fundamentem nowoczesnych systemów politycznych.",
                    "img": "WydarzeniaImg/demokracja.png"
                },
                {
                    "title": "Upadek Cesarstwa Zachodniorzymskiego",
                    "text": "Upadek cesarstwa był wynikiem kryzysu gospodarczego, politycznego i najazdów ludów barbarzyńskich. Zanikła sprawna administracja, handel i bezpieczeństwo. Europa Zachodnia weszła w okres rozdrobnienia politycznego. Wydarzenie to symbolicznie kończy epokę starożytności i rozpoczyna średniowiecze.",
                    "img": "WydarzeniaImg/upadek_cesarstwa.jpg"
                },
                {
                    "title": "Wyprawy krzyżowe",
                    "text": "Krucjaty były serią wypraw zbrojnych organizowanych przez chrześcijan w celu odzyskania Jerozolimy z rąk muzułmanów. Motywowane były religijnie, ale także politycznie i ekonomicznie. Choć militarnie często kończyły się porażką, doprowadziły do rozwoju handlu, wymiany kulturowej oraz poznania nowych towarów i idei. Jednocześnie przyniosły ogromne cierpienie i zniszczenia.",
                    "img": "WydarzeniaImg/wyprawy.jpg"
                },
                {
                    "title": "Powstanie uniwersytetów",
                    "text": "Pierwsze uniwersytety powstały jako centra nauki i dyskusji intelektualnej. Kształcono tam duchownych, prawników i lekarzy. Nauczanie opierało się na filozofii i logice, a wiedza była systematyzowana. Uniwersytety stały się fundamentem rozwoju nauki w Europie.",
                    "img": "WydarzeniaImg/uniwersytet.jpg"
                },
                {
                    "title": "Wielkie odkrycia geograficzne",
                    "text": "Europejczycy rozpoczęli dalekie wyprawy morskie w poszukiwaniu nowych dróg handlowych. Doprowadziło to do odkrycia Ameryki i opłynięcia Ziemi. Odkrycia te zmieniły gospodarkę świata, zapoczątkowały kolonializm i doprowadziły do podporządkowania oraz wyniszczenia wielu ludów tubylczych. Europa stała się centrum światowej polityki i handlu.",
                    "img": "WydarzeniaImg/wielkie_odkrycia.jpg"
                },
                {
                    "title": "Rewolucja francuska",
                    "text": "Rewolucja francuska była buntem społeczeństwa przeciwko nierównościom i władzy absolutnej króla. Zniesiono przywileje stanowe i ogłoszono prawa człowieka i obywatela. Choć rewolucja doprowadziła do chaosu i terroru, jej idee wpłynęły na rozwój demokracji i nowoczesnych państw na całym świecie.",
                    "img": "WydarzeniaImg/rewolucja.jpg"
                },
                {
                    "title": "Rewolucja przemysłowa",
                    "text": "Wprowadzenie maszyn i fabryk radykalnie zmieniło produkcję i życie codzienne. Ludzie masowo przenosili się do miast, powstała klasa robotnicza. Warunki pracy były ciężkie, co prowadziło do protestów i narodzin ruchów robotniczych. Rewolucja przemysłowa przyspieszyła rozwój cywilizacji, ale pogłębiła nierówności społeczne.",
                    "img": "WydarzeniaImg/rewolucja_przemyslowa.jpg"
                },
                {
                    "title": "I wojna światowa",
                    "text": "Wojna objęła większość państw Europy i wykorzystała nowoczesną broń, co doprowadziło do ogromnych strat ludzkich. Załamał się dawny porządek polityczny, a wielkie imperia przestały istnieć. Konflikt pozostawił Europę zniszczoną i pełną napięć, które nie zostały rozwiązane.",
                    "img": "WydarzeniaImg/pierwsza_wojna.jpg"
                },
                {
                    "title": "Wielki kryzys gospodarczy",
                    "text": "Krach giełdowy w USA spowodował globalny kryzys. Miliony ludzi straciły pracę, oszczędności i poczucie bezpieczeństwa. Państwa nie radziły sobie z problemami społecznymi, co sprzyjało wzrostowi poparcia dla radykalnych ideologii i dyktatur.",
                    "img": "WydarzeniaImg/wielki_kryzys.jpg"
                },
                {
                    "title": "II wojna światowa",
                    "text": "II wojna światowa objęła niemal cały świat i pochłonęła dziesiątki milionów ofiar. Naziści dokonali planowej zagłady Żydów i innych grup. Wojna zakończyła się klęską Niemiec i Japonii oraz całkowitą zmianą układu sił politycznych. Europa była zrujnowana, a świat podzielony na nowe strefy wpływów.",
                    "img": "WydarzeniaImg/druga_wojna.jpg"
                },
                {
                    "title": "Zimna wojna",
                    "text": "Upadek muru berlińskiego i rozpad ZSRR zakończyły epokę zimnej wojny. Kraje Europy Środkowo-Wschodniej odzyskały suwerenność i rozpoczęły proces przemian politycznych i gospodarczych. Świat wszedł w nowy etap globalnych powiązań.",
                    "img": "WydarzeniaImg/zimna_wojna.jpg"
                }
            ]
            
        }

}